{
    "education": [
        {
            "school": "Salesians de Sarrià",
            "startingYear": 2014,
            "finishYear": 2017,
            "startingMonth": "Set",
            "finishMonth": "Jun",
            "fullName": "Sistemes microinformàtics i xarxes (SMX)",
            "studyLevel": "Formació Professional de Grau Mitjà",
            "location": "Barcelona",
            "technologies": [
                "Windows",
                "Windows Server",
                "Linux",
                "Linux Server",
                "Línia de comandes",
                "Active Directory",
                "DNS",
                "Samba",
                "Xarxes",
                "Cisco Packet Tracer",
                "Microsofot Visio",
                "Hardware",
                "HTML & CSS",
                "Javascript",
                "Word",
                "Excel",
                "Access",
                "Sony Vegas"
            ]
        },
        {
            "school": "Centre d'Estudis Politécnics",
            "startingYear": 2020,
            "finishYear": 2022,
            "startingMonth": "Set",
            "finishMonth": "Jun",
            "fullName": "Desenvolupament d'aplicacions multiplataforma (DAM)",
            "studyLevel": "Formació Professional de Grau Superior",
            "location": "Barcelona",
            "technologies": [
                "Java",
                "C#",
                "MySQL",
                "SQL Server",
                "HTML5 & CSS",
                "MongoDB",
                "Shell Scripting",
                "UML",
                "XSD",
                "JUnit",
                "Java Android Studio",
                "Microsoft Visual Studio",
                "NetBeans"
            ]
        }
    ],
    "aboutme": {
        "title": "¿Quién sóc?",
        "text": "Hola! Sóc un desenvolupador full stack apassionat amb experiència en aplicacions multiplataforma i sistemes microinformàtics i de xarxa. He treballat amb tecnologies punteres com TypeScript (Angular, Node.js), JavaScript, ASP.NET, PHP, .NET Framework i C#, desenvolupant aplicacions web, d’escriptori i APIs que integren sistemes de manera eficient. La meva experiència inclou el disseny i la gestió de bases de dades SQL Server, optimització d’aplicacions i resolució de problemes complexos, sempre buscant solucions robustes i escalables. He participat en projectes que milloren els processos interns, incrementen l’eficiència i faciliten la interacció entre sistemes. Al llarg de la meva carrera, he desenvolupat no només habilitats tècniques sòlides, sinó també una mentalitat analítica i enfocament en la resolució de problemes. Estic constantment buscant nous reptes i oportunitats per aportar valor en projectes innovadors. Estic llest per col·laborar en el teu proper projecte i portar-lo al següent nivell!",
        "introExperiencias": "He acumulat una valuosa experiència com a programador, començant amb un enfocament multidisciplinari que m'ha permès no només dominar habilitats tècniques, sinó també desenvolupar una mentalitat analítica i una capacitat per resoldre problemes de manera eficient.",
        "verexperiencias": "Veure les meves experiències laborals >>"
    },
    "languages": {
        "angular": {
            "name": "Typescript",
            "progress": "90",
            "frameworks": [
                {
                    "id": "angular",
                    "nombre": "Angular"
                },
                {
                    "id": "ionic",
                    "nombre": "Ionic"
                }
            ],
            "experiences": [
                "Desenvolupament integral d’una aplicació Angular modular i altament personalitzada per a la gestió de control d’accés físic. La solució combina tecnologies web modernes amb integració directa de maquinari client, oferint autenticació multifactor, comunicació en temps real (mitjançant Socket.IO, WebSocket i SignalR) i generació de documentació personalitzada. A més, es van implementar certificats SSL per garantir la seguretat de les comunicacions."
            ],
            "tecnologias": [
                "RxJS (programació reactiva avançada)",
                "Socket.IO / WebSocket / SignalR (comunicació en temps real amb middleware propi)",
                "CryptoJS / Web Crypto API (AES-128, AES-256 i XOR)",
                "LocalStorage / SessionStorage (persistència al client)",
                "WebUSB / WebHID (lectura de targetes NFC via USB sense llibreries externes)",
                "i18n dinàmic amb JSON (traduccions carregades en runtime)",
                "DOM API directe (manipulació manual per a integració amb llibreries heretades)",
                "JavaScript legacy (sense mòduls ni typings)",
                "Generació de PDFs (a partir de dades XML)",
                "Reconeixement facial (mitjançant llibreries externes al navegador)",
                "SCSS i CSS (estils personalitzats)",
                "Certificats SSL (configuració i desplegament per assegurar la comunicació)",
                "Consum d’API (obtenció i enviament de dades)"
            ],
            "funcionalidades": [
                "Captura i anàlisi de fotografies per a reconeixement facial local utilitzant llibreries externes.",
                "Lectura NFC per USB sense llibreries externes utilitzant APIs natives del navegador (WebUSB/WebHID).",
                "Generació de PDFs personalitzats a partir de dades XML.",
                "Comunicació bidireccional en temps real amb middleware propi mitjançant sockets (Socket.IO, SignalR).",
                "Consum d’APIs REST externes per a validació i sincronització.",
                "Arquitectura 100% reactiva amb RxJS.",
                "Emmagatzematge de sessió i dades temporals en LocalStorage/SessionStorage.",
                "Xifrat en client amb AES-128, AES-256 i XOR.",
                "Suport multillenguatge mitjançant fitxers JSON dinàmics.",
                "Integració de JavaScript legacy amb manipulació directa del DOM.",
                "Estilització de components amb SCSS i CSS personalitzats.",
                "Implementació de SSL per protegir les comunicacions i prevenir atacs d’intermediari (MITM)."
            ],
            "responsabilidades": [
                "Disseny i desenvolupament de l’arquitectura de microcomponents en Angular.",
                "Integració amb maquinari NFC/USB sense llibreries externes.",
                "Implementació de reconeixement facial optimitzat per a execució en client.",
                "Creació de fluxos reactius amb RxJS per a gestió d’estat i esdeveniments.",
                "Integració de comunicació en temps real amb Socket.IO, WebSocket i SignalR.",
                "Desenvolupament de lògica de xifrat i gestió segura de dades en client.",
                "Implementació de pipelines per a generació de PDFs des d’XML.",
                "Configuració de suport multillenguatge i integració de llibreries JS heretades.",
                "Configuració i desplegament de certificats SSL per a l’entorn de producció.",
                "Aplicació de SCSS/CSS per a un disseny adaptable i mantenible."
            ]
        },
        "javascript": {
            "name": "Javascript",
            "progress": "70",
            "frameworks": [
                {
                    "id": "Node",
                    "nombre": "Node.js"
                }
            ],
            "experiences": [
                "Desenvolupament d’un servidor Node.js que funcionava com a passarel·la en temps real entre una aplicació Angular (SPA allotjada a IIS) i un backend empresarial en .NET.\nEl servidor gestionava l’estat dels usuaris actius, retransmetia esdeveniments entre Angular i .NET, i proporcionava traduccions dinàmiques per al sistema multillenguatge."
            ],
            "tecnologias": [
                "Node.js i Express.js",
                "Socket.IO (connexió en temps real amb Angular)",
                "Sockets TCP (.NET Sockets) per a comunicació amb backend en .NET",
                "IIS com a servidor de hosting per a Angular i Node.js",
                "fs (gestió d’arxius i generació de JSON per a i18n)",
                "HTTPS/SSL (comunicacions segures entre Node.js, Angular i .NET)"
            ],
            "funcionalidades": [
                "Recepció d’esdeveniments des del backend .NET mitjançant sockets TCP segurs.",
                "Emissió en temps real cap a Angular amb Socket.IO:",
                {
                    "Emissió en temps real cap a Angular amb Socket.IO": [
                        "Expulsió d’usuaris",
                        "Tancament automàtic de sessió (timeout d’inactivitat)",
                        "Notificacions automàtiques tipus push"
                    ]
                },
                "Processament d’esdeveniments des d’Angular i retransmissió al backend .NET.",
                "Conversió de traduccions des d’Access → JSON per integrar-les en el sistema d’i18n d’Angular (espanyol, català, anglès).",
                "Configuració de SSL en Node.js per garantir seguretat d’extrem a extrem."
            ],
            "responsabilidades": [
                "Implementació d’un servidor Node.js orientat a esdeveniments.",
                "Disseny de la capa de comunicació bidireccional entre Angular i .NET.",
                "Integració de Socket.IO a Angular per al control de sessió i notificacions.",
                "Gestió d’usuaris connectats i sincronització amb backend .NET.",
                "Desenvolupament de scripts d’automatització per a i18n (traduccions a JSON).",
                "Configuració de HTTPS/SSL i coordinació de certificats entre sistemes.",
                "Desplegament i configuració conjunta a IIS amb la SPA Angular."
            ],
            "id": "javascript"
        },
        "netframework": {
            "name": ".NET Framework",
            "progress": "70",
            "frameworks": [
                ".NET Framework 4.8"
            ],
            "experiences": [
                "Vaig dissenyar i desenvolupar un ecosistema distribuït en .NET per a la gestió del control d’accés físic, amb múltiples servidors i programes connectats entre si i amb aplicacions mòbils/escriptori. El sistema integrava autenticació multifactor (NFC, QR, empremta dactilar, reconeixement facial), gestió centralitzada d’usuaris i permisos, i sincronització en temps real amb dispositius de maquinari.",
                "El servidor principal actuava com a nucli de comunicació, gestionant menús i crides asíncrones, i enviant/rebent paquets encriptats amb XOR o AES. Els servidors secundaris ampliaven funcionalitats específiques, i un servidor de distribució s’encarregava d’enviar dades i fotografies a dispositius seleccionats. Tota la comunicació es realitzava en forma de paquets binaris estructurats (tipus de protocol, origen, tipus de xifrat), amb CRC16/CRC32 per garantir la integritat.",
                "L’aplicació principal d’escriptori permetia el registre de treballadors, visitants i contractistes, així com la gestió de centres, plantes, departaments i permisos d’accés. Depenent de la configuració, la informació es propagava automàticament als dispositius connectats via sockets o de forma manual des de l’aplicació.",
                "Un servidor d’API exposava endpoints (Service.cs, Program.cs, Startup.cs) per al consum per aplicacions Angular, Ionic i Android Studio, utilitzant SignalR per a sincronització en temps real. El reconeixement facial es va implementar mitjançant OpenCV i altres llibreries de tercers, i la missatgeria offline es gestionava mitjançant un broker MQTT propietari, capaç d’enviar notificacions encriptades a aplicacions sense dependre de Firebase."
            ],
            "tecnologias": [
                ".NET Framework (desenvolupament de servidors i APIs)",
                "SQL Server (connexió directa amb llibreria nativa de .NET i consultes SQL pures)",
                "ADO.NET (model de connexió reutilitzable per a querys i accés a dades)",
                "Sockets TCP/IP (comunicació en temps real entre servidors i programes)",
                "Criptografia: XOR i AES (encriptació de paquets)",
                "CRC16 / CRC32 (verificació d’integritat en protocols interns)",
                "OpenCV (reconeixement facial en fotografies)",
                "SignalR (comunicació en temps real amb Angular i aplicacions web)",
                "NuGet packages: OWIN, llibreries pròpies del framework i de tercers",
                "MQTT (Message Broker) (missatgeria offline i notificacions en apps pròpies)",
                "Ionic / Android Studio / Angular (ecosistema de clients connectats)"
            ],
            "funcionalidades": [
                "Gestió d’usuaris i accessos: registre de treballadors, visitants i contractistes, amb assignació de permisos per planta, departament i secció.",
                "Autenticació multifactor: NFC, QR, empremta dactilar i reconeixement facial.",
                "Comunicació en temps real: enviament i recepció de paquets entre servidors i programes amb sockets TCP/IP.",
                "Paquets binaris personalitzats: amb metadades (origen, tipus de protocol, tipus de xifrat) + CRC16/CRC32 per a verificació.",
                "Criptografia integrada: XOR i AES per assegurar les comunicacions.",
                "Reconeixement facial: validació de fotografies abans del registre, garantint compatibilitat amb dispositius biomètrics.",
                "Sincronització de dades amb dispositius Android: mitjançant un servidor de distribució.",
                "API REST + SignalR: servidor d’API per a integració amb Angular, Ionic i Android Studio.",
                "Missatgeria offline: mitjançant MQTT per a enviament de notificacions a aplicacions propietàries.",
                "Model d’accés a dades reutilitzable: connexió centralitzada a SQL Server i construcció de querys des d’objectes."
            ],
            "responsabilidades": [
                "Disseny i implementació de l’arquitectura distribuïda en .NET (servidor principal, servidors secundaris, servidor de distribució i servidor d’API).",
                "Desenvolupament de l’aplicació d’escriptori per a la gestió d’usuaris, permisos i accessos.",
                "Implementació d’un sistema de comunicació distribuïda mitjançant sockets i paquets binaris encriptats.",
                "Creació del model reutilitzable d’accés a SQL Server amb consultes dinàmiques.",
                "Desenvolupament de lògica de xifrat (AES/XOR) i validació d’integritat (CRC16/CRC32).",
                "Integració d’OpenCV per a reconeixement facial.",
                "Implementació de SignalR per a comunicació en temps real amb Angular.",
                "Configuració d’APIs al servidor d’API (Service.cs, Program.cs, Startup.cs).",
                "Desenvolupament de processos de sincronització amb dispositius Android mitjançant servidor de distribució.",
                "Implementació de MQTT com a message broker per a missatgeria offline.",
                "Coordinació de múltiples tecnologies (.NET, SQL, Angular, Ionic, Android) en un sistema unificat."
            ],
            "id": "netframework"
        },
        "javaandroid": {
            "name": "Java (Android Studio)",
            "progress": "70",
            "frameworks": [
                "Native Android",
                "Cordova"
            ],
            "experiences": [
                "Vaig desenvolupar aplicacions amb interacció amb API, reconeixement biomètric, NFC, escaneig de QR, configuració de xarxa, encriptació de fotografies i optimitzacions de rendiment."
            ],
            "id": "javaandroid"
        },
        "sqlserver": {
            "name": "SQL Server",
            "progress": "70",
            "frameworks": [],
            "experiences": [
                "Realitzo manteniment i actualitzacions regulars a SQL Server per garantir el seu correcte funcionament i seguretat.",
                "Vaig aprendre a treballar amb SQL Server durant els meus estudis de programació i des de llavors l'he utilitzat com a base de dades principal en totes les aplicacions en les quals treballo."
            ],
            "id": "sqlserver"
        },
        "mysql": {
            "name": "MySQL",
            "progress": "70",
            "frameworks": [],
            "experiences": [
                "Vaig mantenir i consultar PHP per a la gestió de MySQL des de la UI, així com l'ús de procediments, disparadors, CRUD i connexió amb altres llenguatges."
            ],
            "id": "mysql"
        },
        "php": {
            "name": "PHP",
            "progress": "20",
            "frameworks": [
                "WordPress"
            ],
            "experiences": [
                "Vaig migrar una pàgina web de PHP 5.3 a PHP 8.1 i vaig fer les actualitzacions corresponents.",
                "Vaig treballar en el manteniment i les consultes en PHP per a la gestió de MySQL des de la UI."
            ],
            "id": "php"
        },
        "htmlcss": {
            "name": "HTML & CSS",
            "progress": "90",
            "frameworks": [],
            "experiences": [
                "Vaig desenvolupar projectes en HTML/5, CSS/3 i SCSS, amb animacions, transformacions i transicions."
            ],
            "id": "htmlcss"
        },
        "batch": {
            "name": "Batch Scripting",
            "progress": "60",
            "frameworks": [],
            "experiences": [
                "Automatització d'instal·lacions i enllaços de certificats SSL en IIS, així com instal·lació de programes de forma automatitzada."
            ],
            "id": "batch"
        },
        "ionic": {
            "name": "Ionic",
            "progress": "65",
            "frameworks": [
                {
                    "id": "capacitor",
                    "nombre": "Capacitor"
                },
                {
                    "id": "Cordova",
                    "nombre": "Cordova"
                }
            ],
            "experiences": [
                "Desenvolupament d’aplicacions híbrides per a mòbils utilitzant Ionic.\nImplementació d’interfícies d’usuari responsives i integració amb APIs backend."
            ],
            "tecnologias": [
                "Ionic Framework",
                "Angular / React",
                "TypeScript",
                "HTML5 i CSS3",
                "Cordova / Capacitor",
                "REST APIs"
            ],
            "funcionalidades": [
                "Creació d’aplicacions híbrides per a iOS i Android.",
                "Desenvolupament d’interfícies responsives amb Angular o React.",
                "Integració amb APIs REST i serveis externs.",
                "Gestió de plugins de Cordova i Capacitor per a funcionalitats natives.",
                "Implementació de navegació i lògica d’aplicació mòbil."
            ],
            "responsabilidades": [
                "Desenvolupament i manteniment d’aplicacions mòbils híbrides amb Ionic.",
                "Implementació de components i pàgines responsives amb Angular o React.",
                "Integració de serveis backend i consum d’APIs REST.",
                "Gestió de plugins natives amb Capacitor/Cordova per funcionalitats específiques.",
                "Test i depuració d’aplicacions en dispositius reals i simuladors."
            ],
            "id": "ionic"
        }
    },
    "workingexperiences": {
        "experience1": {
            "startingYear": 2018,
            "finishYear": 2018,
            "startingMonth": "Jul.",
            "finishMonth": "Ago.",
            "nombrePuesto": "Teleoperador",
            "empresa": "Konecta",
            "texto": "",
            "experiences": [
                "Atenció al client resolent i derivant problemes.",
                "Aprenentatge de l'anàlisi de situacions i habilitats de comunicació."
            ]
        },
        "experiencia2": {
            "startingYear": 2018,
            "finishYear": 2019,
            "startingMonth": "Ago.",
            "finishMonth": "Gen.",
            "nombrePuesto": "Auxiliar de seguretat",
            "empresa": "IMAN Corp.",
            "texto": "",
            "experiences": [
                "Responsabilitat en la seguretat d'edificis d'oficines.",
                "Resolució d'incidències i atenció a visitants."
            ]
        },
        "experiencia3": {
            "startingYear": 2018,
            "finishYear": 2023,
            "startingMonth": "Des.",
            "finishMonth": "Ago.",
            "nombrePuesto": "Auxiliar de seguretat",
            "empresa": "Barna Porters",
            "experiences": [
                "Maneig de trànsit i seguretat en esdeveniments esportius.",
                "Anàlisi i maneig de situacions estressants."
            ]
        },
        "experiencia4": {
            "startingYear": 2020,
            "finishYear": 2020,
            "startingMonth": "Gen.",
            "finishMonth": "Jun.",
            "nombrePuesto": "Tècnic informàtic",
            "empresa": "MovilClinic",
            "experiences": [
                "Atenció al client presencial i reparació de dispositius.",
                "Registre i seguiment de reparacions mitjançant ERP."
            ]
        },
        "experiencia5": {
            "startingYear": 2022,
            "finishYear": 2025,
            "startingMonth": "Jun.",
            "finishMonth": "Abr",
            "nombrePuesto": "Desenvolupador Full-Stack Jr.",
            "empresa": "Qontinuum Plus SL",
            "experiences": [
                "Vaig desenvolupar una aplicació Android per al control d'accessos, reduint en un 40% el temps de verificació manual.",
                "Vaig construir un ERP web amb TypeScript i Angular, optimitzant els processos de negoci en diversos departaments.",
                "Vaig implementar protocols de seguretat i integració de certificats SSL, millorant la fiabilitat del sistema i el compliment normatiu.",
                "Vaig lliurar portals d'autoregistre de visitants i gestió d'accessos, augmentant l'eficiència i reduint la càrrega administrativa.",
                "Vaig dissenyar i desplegar aplicacions d'escriptori i APIs RESTful, facilitant la integració de sistemes i accelerant l'intercanvi de dades.",
                "Vaig optimitzar aplicacions heretades mitjançant la migració des de PHP i millores de rendiment, reduint els temps de càrrega de pàgines fins a un 60%.",
                "Vaig liderar la presa de decisions tècniques i l'anàlisi de causes arrel, millorant la qualitat del codi i reduint errors recurrents.",
                "Vaig automatitzar el desplegament d'aplicacions i vaig desenvolupar instal·ladors, minimitzant el temps de desplegament i els errors en la implementació.",
                "Vaig introduir noves tecnologies i vaig actualitzar stacks existents, augmentant l'escalabilitat i la mantenibilitat a llarg termini dels sistemes."
            ]
        }
    },
    "labels": {
        "home": "Inici",
        "education": "Estudis",
        "workingExperience": "Experiència laboral",
        "programmingExperience": "Stack Tecnològic",
        "CV": "Currículum",
        "downloadCV": "Descarregar CV",
        "seeHere": "Veure aquí",
        "intro": "Desenvolupador Full StacK",
        "infoText": "Aquesta pàgina ha sigut creada amb Angular",
        "search": "Cerca"
    },
    "idiomas": {
        "en": "Anglès",
        "es": "Espanyol",
        "ca": "Català"
    }
}